#include "timer.h"


void TIM_Init(void)
{
  TIMSK = (1<<OCIE0);                                            //разрешаем прерывание таймера т0 при событии совпадение
  TCCR0 = (1<<WGM01)|(0<<WGM00)|(1<<CS02)|(0<<CS01)|(1<<CS00); //режим СТС, прескалер - 1024
  TCNT0 = 0;                                                      //обнуляем счетный регистр
  OCR0 = 0x9c;                                                    //прерывания каждые ~ 10 мс
  
  TIMSK |= (1<<OCIE1A);                                           //разрешаем прерывание таймера т1 при событии совпадение
  TCCR1A = (0<<WGM11)|(0<<WGM10);       
  TCCR1B = (0<<WGM13)|(1<<WGM12)|(1<<CS12)|(0<<CS11)|(1<<CS10); //режим работы СТС, прескалер - 1024
  TCNT1 = 0;                                                      //обнуляем счетный регистр
  OCR1A = 0x3d09;                                                 //прерывания каждую секунду
}


ISR(TIMER0_COMP_vect)
{
  BUT_Debrief();  
}


ISR(TIMER1_COMPA_vect)
{
  ES_PlaceEvent(EVENT_SYS_TIMER);  
}
